{
  "nodes": [
    {
      "op": "null", 
      "name": "input", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_cast_subtract_cast_multiply", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "8d63aea955cdda46", 
        "func_name": "tvmgen_default_fused_cast_subtract_cast_multiply"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "d3d1eaa2f85adfbf", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "ac2695e8a86ae024", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_1", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "46e886860b295360", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_2", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "8686624a57dfa5fd", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_3", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "cd81b8a0c593a6fb", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_4", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "72eb5bfe101b233e", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_5", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "ac31c289762cb142", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_6", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "2fac23006976b3ae", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_7", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "3c747cd28dc60d5b", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_8", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ], 
        [
          27, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "6bd54f2ebf0b9b17", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_9", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "d0632aba54c856d4", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_10", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ], 
        [
          33, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "4c086c59d87f83ec", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_11", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "9ec41b967b0f456f", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_12", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          0
        ], 
        [
          39, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_13", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "b040e5433f858b36", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_13", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ], 
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_14", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "777a491b5a13e309", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_14", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_131", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "b040e5433f858b36", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_13", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_141", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "777a491b5a13e309", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_14", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_132", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "b040e5433f858b36", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_13", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_142", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "777a491b5a13e309", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_14", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_133", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "b040e5433f858b36", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_13", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_143", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "777a491b5a13e309", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_14", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_134", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "b040e5433f858b36", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_13", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ], 
        [
          65, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_144", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "777a491b5a13e309", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_14", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          67, 
          0, 
          0
        ], 
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_15", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "1761adcf75fce6b8", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_15", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_16", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "a1244ea0a9396dcd", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_16", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_17", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWOI", 
        "hash": "d9c95355f3faa708", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_17", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          76, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add_clip_18", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "data_layout": "NHWC", 
        "kernel_layout": "HWIO", 
        "hash": "5ba3f4915d64bcb3", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add_clip_18", 
        "out_layout": "", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_avg_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_avg_pool2d", 
        "hash": "c03ed28ffdab2ba6", 
        "layout": "NHWC"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p54", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p55", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_conv2d_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "out_layout": "", 
        "kernel_layout": "HWIO", 
        "hash": "703d0970c7fabcb7", 
        "func_name": "tvmgen_default_fused_nn_conv2d_add", 
        "data_layout": "NHWC", 
        "flatten_data": "0"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "89c7e755e84850bf", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          86, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_softmax", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "fb2816abfd2d65db", 
        "func_name": "tvmgen_default_fused_nn_softmax"
      }, 
      "inputs": [
        [
          87, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_divide_round_cast_clip_cast", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "hash": "6576622cc03c8ec2", 
        "func_name": "tvmgen_default_fused_divide_round_cast_clip_cast"
      }, 
      "inputs": [
        [
          88, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    5, 
    6, 
    8, 
    9, 
    11, 
    12, 
    14, 
    15, 
    17, 
    18, 
    20, 
    21, 
    23, 
    24, 
    26, 
    27, 
    29, 
    30, 
    32, 
    33, 
    35, 
    36, 
    38, 
    39, 
    41, 
    42, 
    44, 
    45, 
    47, 
    48, 
    50, 
    51, 
    53, 
    54, 
    56, 
    57, 
    59, 
    60, 
    62, 
    63, 
    65, 
    66, 
    68, 
    69, 
    71, 
    72, 
    74, 
    75, 
    77, 
    78, 
    80, 
    81, 
    84, 
    85
  ], 
  "heads": [
    [
      89, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "uint8", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "uint8"
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 192, 192, 3], 
        [1, 192, 192, 3], 
        [3, 3, 3, 32], 
        [1, 1, 1, 32], 
        [1, 96, 96, 32], 
        [3, 3, 32, 1], 
        [1, 1, 1, 32], 
        [1, 96, 96, 32], 
        [1, 1, 32, 64], 
        [1, 1, 1, 64], 
        [1, 96, 96, 64], 
        [3, 3, 64, 1], 
        [1, 1, 1, 64], 
        [1, 48, 48, 64], 
        [1, 1, 64, 128], 
        [1, 1, 1, 128], 
        [1, 48, 48, 128], 
        [3, 3, 128, 1], 
        [1, 1, 1, 128], 
        [1, 48, 48, 128], 
        [1, 1, 128, 128], 
        [1, 1, 1, 128], 
        [1, 48, 48, 128], 
        [3, 3, 128, 1], 
        [1, 1, 1, 128], 
        [1, 24, 24, 128], 
        [1, 1, 128, 256], 
        [1, 1, 1, 256], 
        [1, 24, 24, 256], 
        [3, 3, 256, 1], 
        [1, 1, 1, 256], 
        [1, 24, 24, 256], 
        [1, 1, 256, 256], 
        [1, 1, 1, 256], 
        [1, 24, 24, 256], 
        [3, 3, 256, 1], 
        [1, 1, 1, 256], 
        [1, 12, 12, 256], 
        [1, 1, 256, 512], 
        [1, 1, 1, 512], 
        [1, 12, 12, 512], 
        [3, 3, 512, 1], 
        [1, 1, 1, 512], 
        [1, 12, 12, 512], 
        [1, 1, 512, 512], 
        [1, 1, 1, 512], 
        [1, 12, 12, 512], 
        [3, 3, 512, 1], 
        [1, 1, 1, 512], 
        [1, 12, 12, 512], 
        [1, 1, 512, 512], 
        [1, 1, 1, 512], 
        [1, 12, 12, 512], 
        [3, 3, 512, 1], 
        [1, 1, 1, 512], 
        [1, 12, 12, 512], 
        [1, 1, 512, 512], 
        [1, 1, 1, 512], 
        [1, 12, 12, 512], 
        [3, 3, 512, 1], 
        [1, 1, 1, 512], 
        [1, 12, 12, 512], 
        [1, 1, 512, 512], 
        [1, 1, 1, 512], 
        [1, 12, 12, 512], 
        [3, 3, 512, 1], 
        [1, 1, 1, 512], 
        [1, 12, 12, 512], 
        [1, 1, 512, 512], 
        [1, 1, 1, 512], 
        [1, 12, 12, 512], 
        [3, 3, 512, 1], 
        [1, 1, 1, 512], 
        [1, 6, 6, 512], 
        [1, 1, 512, 1024], 
        [1, 1, 1, 1024], 
        [1, 6, 6, 1024], 
        [3, 3, 1024, 1], 
        [1, 1, 1, 1024], 
        [1, 6, 6, 1024], 
        [1, 1, 1024, 1024], 
        [1, 1, 1, 1024], 
        [1, 6, 6, 1024], 
        [1, 1, 1, 1024], 
        [1, 1, 1024, 2024], 
        [1, 1, 1, 2024], 
        [1, 1, 1, 2024], 
        [1, 2024], 
        [1, 2024], 
        [1, 2024]
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        1, 
        7, 
        8, 
        4, 
        9, 
        10, 
        1, 
        11, 
        12, 
        4, 
        13, 
        14, 
        1, 
        15, 
        16, 
        4, 
        17, 
        18, 
        1, 
        19, 
        20, 
        4, 
        21, 
        22, 
        1, 
        23, 
        24, 
        4, 
        25, 
        26, 
        1, 
        27, 
        28, 
        4, 
        29, 
        30, 
        1, 
        31, 
        32, 
        4, 
        33, 
        34, 
        1, 
        35, 
        36, 
        4, 
        37, 
        38, 
        1, 
        39, 
        40, 
        4, 
        41, 
        42, 
        1, 
        43, 
        44, 
        4, 
        45, 
        46, 
        1, 
        47, 
        48, 
        4, 
        49, 
        50, 
        1, 
        51, 
        52, 
        4, 
        53, 
        54, 
        1, 
        55, 
        56, 
        4, 
        57, 
        58, 
        59, 
        60, 
        60, 
        57, 
        60
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90
  ]
}